/*
 *   대입연산자 ( 오른쪽에서 왼쪽으로 이동하여 처리하는 것!! 우항 먼저)
 *   		=>   =		=> a=10; 10을 a 메모리에 첨부하라
 *   복합대입연산자
 *   		=> +=    ex) int a=10; a+=10 ? a=20 왜냐면 a=a+10
 *   		=> -=    ex) int a=10; a-=5;   a=a-5 ,   =10-5=> 5
 *   		=> *= ,,  /=
 *   		=> int  a=10;
 *   			a<<=2;  => 40
 *   			a=a<<2    10*2^2
 *   
 *  		=> &=
 *			int a=10; 
 *			a&=3;
 *							a=a&3   1010  0011   = 0010  = 2
 *		=> |  =
 *			int a =10;  a=a|3 => 10|3   1010 0011 = 1011 = 11
 *
 *		=> ^=
 *			int a=10 ;   a^=3;    1010 0011 = 1001 = 9
 *
 *=======>   =  . += .     -=    *  이정도만 기억해두면 된다
 *
 *			byte : file,network
 *			int, long
 *			double
 *			String
 *			boolean
 *			====================  
 * 			연산자
 * 								++, --, ! , (type)
 * 								+,-,*,/,%
 * 								&& ||
 * 								==, <, > , <=, >=
 * 								=, +=, -=
 * 								? :
 */
public class 이항연산자_대입연산자1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

			int a=10; // 10을 a에 대입
			// 복합 대입 연산자 
			a+=1; // a에 1을 더한값을 대입하라 == a=a+1
			System.out.println(a);
			
			//  한개 증가 ==> a++,++a,a+=1,a=a+1
		    //  2+증가 ==>  b+=2 
	}

}
